BelcorpUSA/framework/Websites/nsCore/FileUploads/XmlTemplates/TemplateCancelledOrder.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:urn="urn:sap-com:document:sap:rfc:functions" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header/>
  <soap:Body>
    <urn:ZWS_MLM_PEDIDOS_{0}>
      <IT_PEDIDOS>
        <!--Zero or more repetitions:-->
        <item>
          <NUMEROPEDIDO>{1}</NUMEROPEDIDO>
          <CLIENTE>
            <CLIENTEID> </CLIENTEID>
            <ENOVO> </ENOVO>
            <NOME> </NOME>
            <SEXO> </SEXO>
            <RUA> </RUA>
            <NUMERORUA> </NUMERORUA>
            <BAIRRO> </BAIRRO>
            <CEP> </CEP>
            <CIDADE> </CIDADE>
            <REGIAO> </REGIAO>
            <EMAIL> </EMAIL>
            <CPF> </CPF>
            <SETORINDUSTRIAL> </SETORINDUSTRIAL>
            <RECEBEDOR> </RECEBEDOR>
            <RUARECEBEDOR> </RUARECEBEDOR>
            <NUMERORUARECEBEDOR> </NUMERORUARECEBEDOR>
            <BAIRRORECEBEDOR> </BAIRRORECEBEDOR>
            <CEPRECEBEDOR> </CEPRECEBEDOR>
            <CIDADERECEBEDOR> </CIDADERECEBEDOR>
            <REGIAORECEBEDOR> </REGIAORECEBEDOR>
            <EMAILRECEBEDOR> </EMAILRECEBEDOR>
          </CLIENTE>
          <TIPOORDEM> {2} </TIPOORDEM>
          <EMISORDAORDEM> {3}</EMISORDAORDEM>
          <RECEBEDORMERCADERIA> {4}</RECEBEDORMERCADERIA>
          <TRASPORTADOR> {5} </TRASPORTADOR>
          <LOTETRANSPORTE>{6}</LOTETRANSPORTE>
          <NUMEROPEDIDOANTERIOR></NUMEROPEDIDOANTERIOR>
          <DATAORDER>{7}</DATAORDER>
          <FORMAPGTO> {8} </FORMAPGTO>
          <INCOTERM></INCOTERM>
          <FRETE>{9}</FRETE>
          <TIPODEVOL></TIPODEVOL>
          <DETAILORDER>
            <!--Zero or more repetitions:-->
                {10}
          </DETAILORDER>
          <ADIANTAMENTO>
            <NUMEROPEDIDO> </NUMEROPEDIDO>
            <VALORFATURA> </VALORFATURA>
            <CREDITOPEDIDOANTERIOR> </CREDITOPEDIDOANTERIOR>
            <DEBITOPEDIDOANTERIOR> </DEBITOPEDIDOANTERIOR>
            <PRIMEIRAPARCELABOLETO> </PRIMEIRAPARCELABOLETO>
            <RECEBIDOBOLETO> </RECEBIDOBOLETO>
            <DATARECEBIMENTOBOLETO> </DATARECEBIMENTOBOLETO>
            <BANCORECEBEDORBOLETO> </BANCORECEBEDORBOLETO>
            <VALORCOBRADOCARTAOCRED> </VALORCOBRADOCARTAOCRED>
            <OPERADORACARTAOCRED> </OPERADORACARTAOCRED>
            <NUMEROPARCELAS> </NUMEROPARCELAS>
            <NUMEROTITULO> {11}</NUMEROTITULO>
          </ADIANTAMENTO>
        </item>
      </IT_PEDIDOS>
    </urn:ZWS_MLM_PEDIDOS_{12}>
  </soap:Body>
</soap:Envelope>
